[NoCoverage] BlockStatement
backend/service/statisticsService.js:12:55
 const getIncomeByDate = promisify(transactionModel.getIncomeByDate);
 
 class StatisticsService {
-  async getFullStatistics(userId, startDate, endDate) {
-    const [incomeSum, expensesSum, expensesByCategory, expensesByDate, incomeByDate] =
-      await Promise.all([
-        getIncomeSum(userId, startDate, endDate),
-        getExpensesSum(userId, startDate, endDate),
-        getExpensesByCategory(userId, startDate, endDate),
-        getExpensesByDate(userId, startDate, endDate),
-        getIncomeByDate(userId, startDate, endDate),
-      ]);
-
-    return { incomeSum, expensesSum, expensesByCategory, expensesByDate, incomeByDate };
-  }
+  async getFullStatistics(userId, startDate, endDate) {}
 
   async getCategoryDetails(userId, category, startDate, endDate) {

[NoCoverage] BlockStatement
backend/service/statisticsService.js:25:66
     return { incomeSum, expensesSum, expensesByCategory, expensesByDate, incomeByDate };
   }
 
-  async getCategoryDetails(userId, category, startDate, endDate) {
-    return await getExpensesListByCategory(userId, category, startDate, endDate);
-  }
+  async getCategoryDetails(userId, category, startDate, endDate) {}
 }
 
