[Killed] BlockStatement
backend/service/authService.js:8:39
 const createUserPromise = promisify(userModel.createUser);
 
 class AuthService {
-  async authenticate(email, password) {
-    const user = await new Promise((resolve, reject) => {
-      userModel.findUserByEmail(email, (err, user) => {
-        if (err) reject(err);
-        else resolve(user);
-      });
-    });
-
-    if (!user) return null;
-
-    const isMatch = await bcrypt.compare(password, user.password);
-
-    return isMatch ? user : null;
-  }
+  async authenticate(email, password) {}
 
   async registerUser(fullname, email, password) {
killedBy: Unit Test: AuthService Success login
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Timeout] BlockStatement
backend/service/authService.js:9:57
 
 class AuthService {
   async authenticate(email, password) {
-    const user = await new Promise((resolve, reject) => {
-      userModel.findUserByEmail(email, (err, user) => {
-        if (err) reject(err);
-        else resolve(user);
-      });
-    });
+    const user = await new Promise((resolve, reject) => {});
 
     if (!user) return null;

[Timeout] BlockStatement
backend/service/authService.js:10:55
 class AuthService {
   async authenticate(email, password) {
     const user = await new Promise((resolve, reject) => {
-      userModel.findUserByEmail(email, (err, user) => {
-        if (err) reject(err);
-        else resolve(user);
-      });
+      userModel.findUserByEmail(email, (err, user) => {});
     });
 

[Killed] ConditionalExpression
backend/service/authService.js:11:13
   async authenticate(email, password) {
     const user = await new Promise((resolve, reject) => {
       userModel.findUserByEmail(email, (err, user) => {
-        if (err) reject(err);
+        if (true) reject(err);
         else resolve(user);
       });
killedBy: Integration Test: API Routes POST /login should redirect on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 302
Received: 500

[Survived] ConditionalExpression
backend/service/authService.js:11:13
   async authenticate(email, password) {
     const user = await new Promise((resolve, reject) => {
       userModel.findUserByEmail(email, (err, user) => {
-        if (err) reject(err);
+        if (false) reject(err);
         else resolve(user);
       });

[Killed] ConditionalExpression
backend/service/authService.js:16:9
       });
     });
 
-    if (!user) return null;
+    if (false) return null;
 
     const isMatch = await bcrypt.compare(password, user.password);
killedBy: Integration Test: API Routes POST /login should redirect on error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 302
Received: 500

[Killed] ConditionalExpression
backend/service/authService.js:16:9
       });
     });
 
-    if (!user) return null;
+    if (true) return null;
 
     const isMatch = await bcrypt.compare(password, user.password);
killedBy: Unit Test: AuthService Success login
statusReason: TypeError: Cannot read properties of null (reading 'id')

[NoCoverage] BlockStatement
backend/service/authService.js:23:49
     return isMatch ? user : null;
   }
 
-  async registerUser(fullname, email, password) {
-    const saltRounds = 8;
-    const hashedPassword = await bcrypt.hash(password, saltRounds);
-
-    return await createUserPromise(fullname, email, hashedPassword);
-  }
+  async registerUser(fullname, email, password) {}
 }
 
