[NoCoverage] BlockStatement
backend/service/transactionService.js:11:44
 const deleteTx = promisify(transactionModel.deleteTransaction);
 
 class TransactionService {
-  async createIncome(amount, date, userId) {
-    return await addIncome(amount, date, userId);
-  }
+  async createIncome(amount, date, userId) {}
 
   async createExpense(amount, date, category, userId) {

[NoCoverage] BlockStatement
backend/service/transactionService.js:15:55
     return await addIncome(amount, date, userId);
   }
 
-  async createExpense(amount, date, category, userId) {
-    return await addExpense(amount, date, category, userId);
-  }
+  async createExpense(amount, date, category, userId) {}
 
   async getAccountSummary(userId) {

[NoCoverage] BlockStatement
backend/service/transactionService.js:19:35
     return await addExpense(amount, date, category, userId);
   }
 
-  async getAccountSummary(userId) {
-    const balance = await getBalance(userId);
-    const transactions = await getRecent(userId);
-    return { balance, transactions };
-  }
+  async getAccountSummary(userId) {}
 
   async removeTransaction(id, type) {

[NoCoverage] ObjectLiteral
backend/service/transactionService.js:22:12
   async getAccountSummary(userId) {
     const balance = await getBalance(userId);
     const transactions = await getRecent(userId);
-    return { balance, transactions };
+    return {};
   }
 

[NoCoverage] BlockStatement
backend/service/transactionService.js:25:37
     return { balance, transactions };
   }
 
-  async removeTransaction(id, type) {
-    if (type !== 'income' && type !== 'expenses') {
-      throw new Error('INVALID_TYPE');
-    }
-    return await deleteTx(id, type);
-  }
+  async removeTransaction(id, type) {}
 
   async updateTransaction(id, type, data) {

[NoCoverage] ConditionalExpression
backend/service/transactionService.js:26:9
   }
 
   async removeTransaction(id, type) {
-    if (type !== 'income' && type !== 'expenses') {
+    if (true) {
       throw new Error('INVALID_TYPE');
     }

[NoCoverage] ConditionalExpression
backend/service/transactionService.js:26:9
   }
 
   async removeTransaction(id, type) {
-    if (type !== 'income' && type !== 'expenses') {
+    if (true && type !== 'expenses') {
       throw new Error('INVALID_TYPE');
     }

[NoCoverage] StringLiteral
backend/service/transactionService.js:27:23
 
   async removeTransaction(id, type) {
     if (type !== 'income' && type !== 'expenses') {
-      throw new Error('INVALID_TYPE');
+      throw new Error("");
     }
     return await deleteTx(id, type);

[NoCoverage] BlockStatement
backend/service/transactionService.js:32:43
     return await deleteTx(id, type);
   }
 
-  async updateTransaction(id, type, data) {
-    const { amount, date, category } = data;
-    if (type === 'income') {
-      return await transactionModel.updateIncomeTransaction(id, amount, date);
-    } else if (type === 'expenses') {
-      return await transactionModel.updateExpenseTransaction(id, amount, date, category);
-    }
-    throw new Error('INVALID_TYPE');
-  }
+  async updateTransaction(id, type, data) {}
 }
 

[NoCoverage] BlockStatement
backend/service/transactionService.js:34:28
 
   async updateTransaction(id, type, data) {
     const { amount, date, category } = data;
-    if (type === 'income') {
-      return await transactionModel.updateIncomeTransaction(id, amount, date);
-    } else if (type === 'expenses') {
+    if (type === 'income') {} else if (type === 'expenses') {
       return await transactionModel.updateExpenseTransaction(id, amount, date, category);
     }

[NoCoverage] ConditionalExpression
backend/service/transactionService.js:34:9
 
   async updateTransaction(id, type, data) {
     const { amount, date, category } = data;
-    if (type === 'income') {
+    if (false) {
       return await transactionModel.updateIncomeTransaction(id, amount, date);
     } else if (type === 'expenses') {

[NoCoverage] EqualityOperator
backend/service/transactionService.js:36:16
     const { amount, date, category } = data;
     if (type === 'income') {
       return await transactionModel.updateIncomeTransaction(id, amount, date);
-    } else if (type === 'expenses') {
+    } else if (type !== 'expenses') {
       return await transactionModel.updateExpenseTransaction(id, amount, date, category);
     }

[NoCoverage] ConditionalExpression
backend/service/transactionService.js:36:16
     const { amount, date, category } = data;
     if (type === 'income') {
       return await transactionModel.updateIncomeTransaction(id, amount, date);
-    } else if (type === 'expenses') {
+    } else if (true) {
       return await transactionModel.updateExpenseTransaction(id, amount, date, category);
     }
