[NoCoverage] BlockStatement
backend/service/userService.js:11:32
 const updateUser = promisify(userModel.updateUserProfile);
 
 class UserService {
-  async getProfileData(userId) {
-    const userInfo = await getUserInfo(userId);
-    if (!userInfo) throw new Error('USER_NOT_FOUND');
-    return userInfo;
-  }
+  async getProfileData(userId) {}
 
   async updateProfile(userId, { fullname, email, password }, file) {

[NoCoverage] ConditionalExpression
backend/service/userService.js:13:9
 class UserService {
   async getProfileData(userId) {
     const userInfo = await getUserInfo(userId);
-    if (!userInfo) throw new Error('USER_NOT_FOUND');
+    if (false) throw new Error('USER_NOT_FOUND');
     return userInfo;
   }

[NoCoverage] BooleanLiteral
backend/service/userService.js:13:9
 class UserService {
   async getProfileData(userId) {
     const userInfo = await getUserInfo(userId);
-    if (!userInfo) throw new Error('USER_NOT_FOUND');
+    if (userInfo) throw new Error('USER_NOT_FOUND');
     return userInfo;
   }

[NoCoverage] BlockStatement
backend/service/userService.js:17:68
     return userInfo;
   }
 
-  async updateProfile(userId, { fullname, email, password }, file) {
-    const hashedPassword = await bcrypt.hash(password, 8);
-
-    let avatarUrl = null;
-    if (file) {
-      const fileName = `${Date.now()}-${file.originalname}`;
-      const uploadPath = path.join(__dirname, '..', 'routes', 'uploads', fileName);
-
-      await fs.writeFile(uploadPath, file.buffer);
-      avatarUrl = `http://localhost:3000/uploads/${fileName}`;
-    }
-
-    return await updateUser(userId, fullname, email, hashedPassword, avatarUrl);
-  }
+  async updateProfile(userId, { fullname, email, password }, file) {}
 }
 

[NoCoverage] ConditionalExpression
backend/service/userService.js:21:9
     const hashedPassword = await bcrypt.hash(password, 8);
 
     let avatarUrl = null;
-    if (file) {
+    if (true) {
       const fileName = `${Date.now()}-${file.originalname}`;
       const uploadPath = path.join(__dirname, '..', 'routes', 'uploads', fileName);

[NoCoverage] BlockStatement
backend/service/userService.js:21:15
     const hashedPassword = await bcrypt.hash(password, 8);
 
     let avatarUrl = null;
-    if (file) {
-      const fileName = `${Date.now()}-${file.originalname}`;
-      const uploadPath = path.join(__dirname, '..', 'routes', 'uploads', fileName);
-
-      await fs.writeFile(uploadPath, file.buffer);
-      avatarUrl = `http://localhost:3000/uploads/${fileName}`;
-    }
+    if (file) {}
 
     return await updateUser(userId, fullname, email, hashedPassword, avatarUrl);

[NoCoverage] StringLiteral
backend/service/userService.js:23:53
     let avatarUrl = null;
     if (file) {
       const fileName = `${Date.now()}-${file.originalname}`;
-      const uploadPath = path.join(__dirname, '..', 'routes', 'uploads', fileName);
+      const uploadPath = path.join(__dirname, '..', "", 'uploads', fileName);
 
       await fs.writeFile(uploadPath, file.buffer);
